//Преобразуем первую входящую строку в целочисленное значение. Это значение является количеством последующих входных строк с датами.
int amountOfdates = int.Parse(Console.ReadLine());

//Инициализируем массив строк для вывода ответов. Количество ответов равно количеству строк с датами.
string [] answers = new string[amountOfdates];

//Создаем цикл для обработки каждой входящей строки с датами.
for(int i = 0; i < amountOfdates; i++)
{
    //Создаем массив строк, чтобы разбить входящую строку на подстроки с помощью разделителя ' '(пробела).
    //Получаем массив из 3-х подстрок-элементов.
    string [] date = Console.ReadLine().Split(' ');
    
    //Каждый элемент преобразуем в целоичисленное значение.
    //Первый элемент = день.
    var day = int.Parse(date[0]);

    //Второй элемент = месяц.
    var month = int.Parse(date[1]);

    //Третий элемент = год.
    var year = int.Parse(date[2]);

    //Первым делом проверям 2-й месяц - февраль.
    if(month == 2)
    {

        //С помощью метода IsLeapYear проверяем, является ли введенный год вискосным или нет.
        //Если год является високосным, то макисмальное количество дней в феврале 29.
        //Если год не является високосным, то макисмальное количество дней в феврале 28.
        if(DateTime.IsLeapYear(year))
        {
            if(day > 29)
            {
                answers[i] = "NO";
            }
            else
            {
                answers[i] = "YES";
            }
        }
        else
        {
            if(day > 28)
            {
                answers[i] = "NO";
            }
            else
                {
                    answers[i] = "YES";
                }
            }
    }

    //Проверям остальные месяцы.
    //В месяцах 1, 3, 5, 7, 8, 10, 12 - не больше 31 дня.
    //В месяцах 4, 6, 9, 11 - не больше 30 дней.
    else if(month != 2)
    {
        if(month % 2 != 0 && month < 9 || month == 8 || month == 10 || month == 12)
        {
            if(day > 31)
            {
                answers[i] = "NO";
            }
            else
            {
                answers[i] = "YES";
            }
        }
        else if (month % 2 == 0 && month < 8 || month == 9 || month == 11)
        {
            if(day > 30)
            {
                answers[i] = "NO";
            }
                else
            {
                answers[i] = "YES";
            }
        }
    }
}

//Выводим эелементы массива строк ответов в терминал
foreach(string element in answers)
{
    Console.WriteLine(element);
}